# RebarHooksDontMatchShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarHooksDontMatchShape Property
BuiltInFailures..::..RebarFailures Class See Also
---
The Rebar's hooks do not match its Rebar Shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarHooksDontMatchShape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHooksDontMatchShape As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarHooksDontMatchShape {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace